<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/app/data/public/user/pages/01.blog/classic-modern-architecture/item.md',
    'modified' => 1644437855,
    'data' => [
        'header' => [
            'title' => 'Что Я пишу?',
            'date' => '17:34 11/11/2020',
            'author' => 'ILya Klishin',
            'description' => 'Feugiat interdum sed commodo ipsum consequat dolor nullam metus',
            'taxonomy' => [
                'category' => 'blog',
                'tag' => [
                    0 => 'aboutMe'
                ]
            ]
        ],
        'frontmatter' => 'title: Что Я пишу?
date: 17:34 11/11/2020
author: ILya Klishin
description: Feugiat interdum sed commodo ipsum consequat dolor nullam metus
taxonomy:
    category: blog
    tag: [aboutMe]',
        'markdown' => 'Я пишу работу. И книгу.

===

## Что Я пишу?



> Авторский проект моего сайта - это здоровый образ мышления и жизни

## Обращение к аудитории

Добрый день.

Я пишу работу. И книгу.

Мне нужны рецензии действующего бизнеса. Действующих директоров и менеджеров. Должно быть подтверждение "реального опыта" против "книжных выводов" кабинетных КЭН, докторов экономических наук, маркетологов и прочих. Такой вот юридически значимый "бунт на корабле" всего написанного о том: как управлять людьми, читая что понимаешь невозможность реализовать и др. надуманности; как внедрить эффективный маркетинг, читая что понимаешь невозможность материала для наших реалий и др.; документооборот ... ; мотивация сотрудников ... ; теория продаж, CRM ... ; ERP ... ; продвижение и реклама ... и еще несколько направлений.

По готовности материалы - высылаю на рецензию и подпись. Если подписываемые Соглашение о конфиденциальности и др. документы вас устроят. У меня есть планы публиковать материалы и количество(!) тех кто считает их верными, но нет планов публиковать кто именно подписал КЭП в ЭДО тот или иной материал.


### Подтверждение "реального опыта" против "книжных доводов" графоманов.

'
    ]
];
