<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/home/kincsadv/web/ilyaklishin.ru/public_html/user/pages/01.blog/todone/item.md',
    'modified' => 1648404688,
    'data' => [
        'header' => [
            'title' => 'Синопсис или резюме сделанного'
        ],
        'frontmatter' => 'title: Синопсис или резюме сделанного',
        'markdown' => '===

## TODAY

---

#### Communication Service

Москва, Генеральный директор, Уникальный опыт проведения кампаний федерального масштаба позволяют реализовывать высокотехнологичные решения: Медиапланирование и медиазакупки в СМИ: ТВ, Интернет, Пресса, Радио, Наружная реклама. Креатив: дизайн, ТВ-ролики, корп.фильмы. Промо-акции в 60 городах России. Исследования рынка. PR - это ваши связи с 40 000+ СМИ в России и не только
02.02.2002 — по настоящее время 

Москва, Управляющий партнер, евангелист Архипрофессионализма, arhi-pro.ru, 25.12.2020 — по настоящее время

Самозанятый: сайты и приложения на VueJS, Vuetify js; CMS: PageKit, Joomla; консультации и исследования; монтаж видео и инфографика. – 13.03.2019

## Синопсис сделанного

---

- РАНХиГС, преподаватель

- создание Юридическая фирма A.LEX.E.Y 01.12.2018 22:09:00

- Институт Современного Искусства, Москва, isi-vuz.ru, Преподаватель, Практический курс: Продвижение Интеллектуальной Собственности, 4 Курс, Менеджмент – Сентябрь 2017 — январь 2019, 1 год 5 месяцев

- Архи-Про, Москва, arhi-pro.ru, Строительство, недвижимость, эксплуатация, проектирование, Managing Director, Административно-хозяйственные вопросы, Бухгалтерия, Продвижение, Реклама и Маркетинг – Октябрь 2004 — июль 2018, 13 лет 10 месяцев

- 4Да Юридическая компания, Москва, да-да-да-да.рф, Managing Director, Start-up, Весь комплекс по первичному старту бизнеса. – Ноябрь 2015 — май 2016, 7 месяцев

- журнал Русский Newsweek, Москва, ru.wikipedia.org/wiki/Русский_Newsweek, СМИ, маркетинг, реклама, BTL, PR, дизайн, продюсирование, Менеджер по работе с клиентами, Работа с клиентом, презентации, продажи. Start sale Newsweek, Проведение презентаций и встреч на всех уровнях, Работа по организации встреч с Леонидом Геннадьевичем Парфеновым – Июнь 2004 — ноябрь 2004, 6 месяцев

- golf style журнал и Гольф клуб, Москва, www.mcgc.ru, Директор по рекламе, Срочный контракт, reStart отдела продаж рекламы, Поиск подбор персонала, Работа с клиентом, презентации, продажи – Апрель 2004 — июнь 2004, 3 месяца

- журнал XXL, Москва, www.xxl-online.ru, СМИ, маркетинг, реклама, BTL, PR, дизайн, продюсирование, Менеджер по работе с клиентами, Работа с клиентом, презентации, продажи – Июнь 2003 — март 2004, 10 месяцев

- Приор РА, Москва, prior.ru, СМИ, маркетинг, реклама, BTL, PR, дизайн, продюсирование, Медиапланер, - осуществлял стратегическое планирование рекламной кампании; - ведение рекламной кампаний в Прессе Panasonic, Амексин, Флюкастат, Спецтехника и др. – Декабрь 2002 — май 2003 6 месяцев

- Редакция газеты Антенна-Телесеть, Москва, www.antenna-telesem.ru, Менеджер по работе с клиентами, Работа с клиентом, презентации, продажи  –  Январь 2002 — ноябрь 2002, 11 месяцев

- Театр ФЭСТ, Мытищи, www.thefest.ru, Искусство, культура, Актер театра и кино, один из творческой группы Май 1995 — апрель 2001, 6 лет


## Обучение

---

- Фреймворк Vue.js, Дмитрий Лаврик dmitrylavrik.ru, Vue.js – 2018

- smartgrid, Дмитрий Лаврик dmitrylavrik.ru, адаптивная вёрстка css3 less npm (gulp autoprefixer etc) – 2018

- Финансовое моделирование в MATLAB, Импорт, визуализация и анализ рыночных данных – 2016

- Владелец и ТОП-менеджмент: баланс интересов, Файсом Лаборатория, Управление Организацией – 2015

- Профессиональный HR: структурная диагностика персонала, Файсом Лаборатория, Управление Персоналом – 2015

- ОТ ИДЕИ ДО СЦЕНАРИЯ ЗА 5 ШАГОВ, Ричард Креволин, Сценарист, Режиссер, Писатель, Продюсер – 2014

- СЦЕНАРНАЯ МАСТЕРСКАЯ, Школа-студия Александра Митты, сценарист, режиссер – 2013

- Владелец и ТОП-менеджмент: баланс интересов, Файсом Лаборатория, Управление Организацией – 2008

- Продажи на рекламном рынке, Джон Вон Эйкен, Активные продажи – 2001

- Институт управления, экономики, права и искусства, Москва, аспирантура, Маркетинг – 2001

- Институт современного искусства, Москва, актер театра и кино (х.р.В.П.Остальский, "щепка"-курс ФЭСТ), актер, режиссер, звукорежиссер – 2000

- Московский государственный университет леса, ФЭСТ - Системы автоматического управления, Системный анализ и управление – 1996

- РЗИТЛП Москва, экономика, Мировая экономика – 1995

## Прививки

---

- ПАПА привил любовь работать руками – 1975

- МАМА привила любовь рисовать, лепить, творить – 1975

- в школе Татьяна Васильевна привила любовь к математике – 1989

- в школе Нели Петровна привила любовь читать – 1989

- в Институте Д.Гашев и С.Пчёлкин привили любовь к программированию – 1994

- в театре И.В.Хвацкая, Д.В.Полянский, И.А.Шаповалов привили любовь к сцене – 1996

- Зоя Алимовна Масленикова привила любовь читать со сцены – 1996

- Майя привила любовь – 2000
'
    ]
];
