<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/home/kincsadv/web/ilyaklishin.ru/public_html/user/pages/01.blog/just-some-text-today/item.md',
    'modified' => 1648404688,
    'data' => [
        'header' => [
            'title' => 'Cила Америки в противостоянии с Россией подорвана',
            'date' => '13:34 06/23/2020',
            'continue_link' => false,
            'author' => 'ILya Klishin',
            'description' => 'Однако подавление в социальных сетях сторонников Дональда Трампа подорвало доверие к данным ресурсам как свободном для мнений пространстве',
            'taxonomy' => [
                'category' => 'blog',
                'tag' => [
                    0 => 'journal'
                ]
            ]
        ],
        'frontmatter' => 'title: Cила Америки в противостоянии с Россией подорвана
date: 13:34 06/23/2020 
continue_link: false
author: ILya Klishin
description: Однако подавление в социальных сетях сторонников Дональда Трампа подорвало доверие к данным ресурсам как свободном для мнений пространстве
taxonomy:
    category: blog
    tag: [journal]',
        'markdown' => '> Cила Америки в противостоянии с СССР и Россией, а также позиционировании на мировой арене всегда заключалась в успешно создаваемой видимости свободы слова. Главным инструментом этого в последние десятилетия стали социальные сети, крупнейшие из которых создавались и контролировались в Штатах. Если не считать отдельные случаи цензуры локальными модераторами (например, в русскоязычном сегменте Facebook набранными на Украине сотрудниками), долгое время можно было говорить о свободе слова в данных ресурсах.
> "Можно было сказать, что соцсеть является местом без цензуры, где каждый мог высказать то, что хочет, и как хочет. И американцы умели эффективно пользоваться этим инструментом тонкой настройки. Что бы мы ни говорили, соцсети – это огромное СМИ, в целом отражающее политику американского государства. И создавалось ощущение, что, наверно, они правы, ведь их большинство, и весь мир их поддерживает", – объяснил политолог.
> Однако подавление в социальных сетях сторонников Дональда Трампа подорвало доверие к данным ресурсам как свободном для мнений пространстве. Ищенко убежден, что после жесткой цензуры в отношении Трампа и трампистов, развернувшейся до полномасштабных цифровых репрессий, соцсети уже невозможно использовать как главный инструмент цветных революций.
'
    ]
];
