<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/home/kincsadv/web/ilyaklishin.ru/public_html/user/pages/01.blog/ilyaklishin/item.md',
    'modified' => 1648404688,
    'data' => [
        'header' => [
            'title' => 'ИЛЬЯ КЛИШИН'
        ],
        'frontmatter' => 'title: ИЛЬЯ КЛИШИН',
        'markdown' => '> Я, Илья Клишин, обыкновенный человек. Я не летал на луну. Ну, не летал. Но если бы вы знали какая она красивая. Я не учился у великих учителей. Но если бы вы знали, как было интересно слушать каждое их слово. Я не делал с нуля рекламное агентство. Но как хорошо было знать, что птенцы его работают почти везде. Я не запускал промо акцию в 60 городов за две недели. Не выигрывал тендеров. Я не делал этого ничего. Я только горжусь многими из тех кого встретил. Особенно оленем с вишневым деревом ... И не буду лить воду.

===


# ИЛЬЯ КЛИШИН: Авторский проект моего сайта - это здоровый образ мышления и жизни


## Продвижение интеллектуальной собственности

Продвижение интеллектуальной собственности - это квинтэссенция, самая суть всех-всех накопленных мной знаний.
Это три основных знания, умения или, одним словом, философии, дословно мудрости. Вот эти три мудрости ниже.



## Три основных для меня

### Material Design

Material Design - намерено не перевожу эту известную фразу. Наполняю её несколько большим смыслом. А именно, Маркетинг, реклама, pr, дизайн, продвижение, разработка, - вот, не полный список всего, что включаю в это понятие для себя.

### Быстрое развитие

Быстрое развитие и разработка. Подобное планирование должно учитывать: контур управления, точки реализации каждого процесса, своевременность человеческих ресурсов и дуализ необходимого и достаточного в отношении оного. И после этого инновации и проектный подход. Как-то так, на основе традиционного, прочного базиса инновации и творческий подход.

### Публичные выступления

Занимаюсь речью с бизнесменами и топ-менеджерами. Умею четко и быстро «дать основу речи и мастерства актера". Актерское мастерство и сценическая речь - это прежде всего труд! Провожу занятия подготовки абитуриентов к поступлению в театральное.
'
    ]
];
