<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/home/kincsadv/web/ilyaklishin.ru/public_html/user/pages/01.blog/london-industry/item.md',
    'modified' => 1648404688,
    'data' => [
        'header' => [
            'title' => 'Правильно поставленная задача',
            'date' => '13:34 06/07/2014',
            'author' => 'ILya Klishin',
            'description' => 'Что такое правильно оставленная задача',
            'taxonomy' => [
                'category' => 'blog',
                'tag' => [
                    0 => 'journal'
                ]
            ]
        ],
        'frontmatter' => 'title: Правильно поставленная задача
date: 13:34 06/07/2014 
author: ILya Klishin
description: Что такое правильно оставленная задача
taxonomy:
    category: blog
    tag: [journal]',
        'markdown' => 'Правильно поставленная задача для услуги аналитика

===


## Что такое правильно оставленная задача

> Василий Иванович, приборы?
>
> Петька, двадцать!
>
> Василий Иванович, а что двадцать?
> 
> Петька, а что "приборы"? 

---

### Задача это ответы на все вопросы:

- Кто
- Что
- Как
- Когда
- Кто контролер
- Кому

Бриф (от англ. brief «инструкция, сводка») — документ, краткая письменная форма согласительного порядка между планирующими сотрудничать сторонами, в которой прописываются основные параметры будущего проекта.

> Если задача поставлена не внимательно,
> то ответ может удивить.

### Правильно поставленная задача для услуги аналитика

Бриф — это вопрос и ответ на него. Ответ на вопрос "кому": очевидно описывает руководство и владельцев организации.
Компетенции "контролера" должны охватывать хотя бы часть КП аналитика.
... продолжение следует ...
(страница создана для определенной цели)
'
    ]
];
