<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/app/data/public/user/pages/02.about/default.md',
    'modified' => 1644437145,
    'data' => [
        'header' => [
            'title' => 'Обо мне',
            'route' => 'about'
        ],
        'frontmatter' => 'title: Обо мне
route: about',
        'markdown' => '## Что Я ищу?

### Интересные и сложные задачи!



> Авторский проект моего сайта - это здоровый образ мышления и жизни

---

![About Image](about.jpeg?cropResize=400,200){.imageleft} Мозг — это, конечно, не мышца, но все же он нуждается в постоянных тренировках, чтобы находиться в тонусе, быть способным решать самые сложные жизненные задачи и быстро реагировать. Один из самых простых способов поддерживать «серое вещество» в форме — загадки и головоломки.

Ага! Что? Уже пора смеяться? Или прямо таки — ржать!? Мозгу загадки и головоломки? Головоломки? Еще скажите кроссворды ... А, ведь такой мудрой чепухой полон весь top-интернет...

Раз затронул эту тему, выражу своё мнение так: Мозг — это, конечно, не мышца (привет мистеру Очевидность) и, да, только регулярная нагрузка мозга позволит не деградировать.

Каждые 10 лет человек теряет 10 IQ в среднем. И кто-то больше. Кто-то меньше.

Вот, чтобы быть среди лучших, нужно:

* в сроки, вписываясь в бюджет делать то, что требуется;
> а ни как Архимед нырял в ванную, изобретая нечто фундаментальное, когда царь просил его создать конкретное оружие против персов(цитата из мультфильма: не цепляйтесь к мелочам этой истории)
* Сделать дело, хорошо структурируя документацию и другую информацию;
* И работая с хорошо структурированной информацией(!), так-таки создавая и используя хорошо структурированный поток данных;
> а не просто почитывая детективы или, Боже упаси, разгадывать кроссворды руководствуясь мотивацией: «чтоб мозг не забывал работать»
* выполняя задачи не «для себя» и не «как мне хочется и удобно»;
* взрывая борьеры своих компитенций, как Сергей Бубка брал всё новые высоты в своём профессиноализме.

### Так закалялась сталь.

> Регулярно и постоянно дополнительное профессиональное обучение. Опыт в реальных проектах. Тендерный способ доказать свою правоту в профессиональноей области.

### Так становятся великим конструктором, режиссером, актером.

Не через постель. Не по блату. Ни как. Только так.

А все кто не согласен, добро пожаловать на сайты троль.xyz, падонак рф etc — и прочь от сюда!

### Каждый проект — это много самых разных сложных задач.

### Возможность внедрить самые передовые решения и технологии.

---

[Контакт со мной](/about) {.button}'
    ]
];
