<?php
return [
    '@class' => 'Grav\\Common\\File\\CompiledMarkdownFile',
    'filename' => '/home/kincsadv/web/ilyaklishin.ru/public_html/user/pages/offer/default.md',
    'modified' => 1648404688,
    'data' => [
        'header' => [
            'title' => 'ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ С КОНЕЧНЫМ ПОЛЬЗОВАТЕЛЕМ'
        ],
        'frontmatter' => 'title: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ С КОНЕЧНЫМ ПОЛЬЗОВАТЕЛЕМ',
        'markdown' => 'Настоящее Лицензионное соглашение с конечным пользователем (Далее «Лицензионное соглашение», «Соглашение») является юридически обязывающим договором между вами, выступающим в качестве физического или юридического лица (далее – Пользователь) и Клишиным Ильёй Николаевичем, ИНН 505004193846 (Далее – Правообладатель).

Выступая от имени юридического лица (а равно любого другого лица, которое вы представляете), вы подтверждаете, что обладаете всеми необходимыми полномочиями на совершение действий, которыми такое лицо связывается настоящим Соглашением.

Внимательно прочтите условия и положения настоящего соглашения перед загрузкой, копированием, установкой, получением или активацией лицензионного ключа, а равно до начала использования Программных продуктов Правообладателя. Совершение любого из указанных в настоящем абзаце действий признается безусловным принятием настоящего Соглашения.

"Нажимая кнопку «Я согласен с условиями настоящего Лицензионного договора и принимаю их», а также совершая действия, указанный в абзаце 3 преамбулы, Вы подтверждаете, что Ваше согласие является осознанным и добровольным, а также то, что Вы будете соблюдать условия настоящего Лицензионного договора.

В приложениях к настоящему Соглашению (в том числе, включаемых в форме ссылок) могут содержаться дополнительные условия в отношении всех или отдельных программных продуктов, а также сопутствующих услуг или отдельных обязательств сторон. Все дополнительные условия, правила, регламенты, на которые сделана ссылка в настоящем Соглашении, подлежат применению так, как если бы такие документы были включены непосредственно в текст Соглашения.

## 1. ОСНОВНЫЕ ПОНЯТИЯ И ОПРЕДЕЛЕНИЯ

1.1.    Правообладатель – Клишин Илья Николаевич, ИНН 505004193846.

1.2.    Пользователь – лицо, действующее в соответствии с законодательством государства своего местонахождения и правомочное вступать в правоотношения с Правообладателем по настоящему Лицензионному договору.

1.3.    Лицензионное соглашение (Соглашение) – настоящее Лицензионное соглашение со всеми приложениями (дополнениями) к нему. В приложениях к настоящему Лицензионному соглашению (в том числе, включаемых в форме ссылок) могут содержаться дополнительные условия. Все дополнительные условия, правила, регламенты, на которые сделана ссылка в настоящем Лицензионном соглашении, подлежат применению так, как если бы такие документы были включены непосредственно в текст.

1.4.    Программный продукт – программа для ЭВМ

1.5.    Ключи активации – элемент системы технических средств защиты авторских прав, используемой Правообладателем для защиты Программного продукта от неправомерного использования, а также для предоставления на условиях неисключительной лицензии.

1.6.    Сайт Правообладателя – совокупность веб-страниц, размещенных в информационно-телекоммуникационной сети Интернет и объединенных единым адресным пространством домена ilyaklishin.ru и поддоменов следующих уровней.

1.7.    Личный кабинет – веб-интерфейс системы Правообладателя, размещенной на Сайте Правообладателя, или веб-интерфейс системы Программного продукта, размещенной на Сайте Программного продукта.

## 2.     ПРЕДМЕТ СОГЛАШЕНИЯ

2.1.    По настоящему Лицензионному соглашению Правообладатель предоставляет Пользователю неисключительное, возмездное ограниченное во времени, непередаваемое, отзывное право использования Программного продукта (Лицензию) в соответствии с его функциональным назначением.

2.2.    Срок, на который предоставлено право использования Программного продукта, размер лицензионного вознаграждения, а также объем предоставляемых прав использования определяются конкретным договором и типом лицензии, на основании которого Пользователю предоставлено право использования. Однако права использования, предоставленные таким конкретным договором не могут противоречить настоящему Лицензионному соглашению.

## 3.     РАЗРЕШЕННОЕ ИСПОЛЬЗОВАНИЕ

3.1.    Пользователю предоставляется право использовать Программный продукт следующими способами:

3.1.1.   путем воспроизведения Программного продукта посредством записи (инсталляции) одной копии Программного продукта в память одного ЭВМ (виртуальной машины);

3.1.2.   путем доведения Программного продукта до всеобщего сведения таким образом, что любое или определенное Пользователем лицо могло получить к нему доступ по информационно-телекоммуникационной сети, в том числе сети Интернет; при этом доведение до всеобщего сведения может быть осуществлено исключительно такими способами, при которых третьим лицам (Клиентам) предоставляется доступ только к порождаемым Программным продуктом визуальным отображениям и (или) предоставляется возможность интерактивного взаимодействия с функциональной частью Программного продукта и только тогда, когда предоставление такого доступа является функциональной частью Программного продукта;

3.2.    Право пользования Программным продуктом предоставляется Пользователю со следующими ограничениями:

3.2.1.   Пользователю запрещается модифицировать Программный продукт, т.е. вносить в него любые изменения за исключением:

3.2.1.1.   изменения настроек Программного продукта или иных подобных изменений, осуществляемых путем использования описанных в документации (Сопроводительных материалах) возможностей Программного продукта;

3.2.1.2.   адаптации, т.е. изменений, независимо от способа их осуществления, которые производятся исключительно в целях обеспечения функционирования Программного продукта на конкретных технических средствах Пользователя или под управлением конкретных программ Пользователя;

3.2.1.3.   установки обновлений Программного продукта, выпущенных Правообладателем.

3.2.2.   При любом использовании Программного продукта Пользователю запрещается:

3.2.3.   осуществлять переработку, декомпилировать, дизассемблировать, вскрывать технологию, разбирать или каким-либо другим способом пытаться извлечь исходный код Программного продукта, вносить какие-либо изменения в исходный и объектный код;

3.2.4.   изменять структуру Программного продукта и/или входящих в них баз данных, состав содержащихся в них сведений (за исключением случаев, когда такие действия предусмотрены функционалом Программного продукта и/или документацией на Программный продукт);

3.2.5.   осуществлять какие-либо действия, результатом которых является изменение или удаление порождаемых Программным продуктом визуальных отображений товарного знака, знака обслуживания, коммерческого обозначения или знака охраны авторского права. Также запрещается осуществлять любые действия, в результате которых существенно затрудняется распознавание указанных в настоящем пункте визуальных отображений, в частности, их затемнение или изменение их оригинальных размеров. Изменение указанных в настоящем пункте визуальных отображений допустимо только средствами, предлагаемыми непосредственно интерфейсом Программного продукта.

3.2.6.   блокировать работу технических средств защиты авторских прав;

3.2.7.   изменять или создавать какие-либо производные продукты (произведения) на основе Программного продукта или любого его элемента (включая аудиовизуальный ряд и исходный код);

3.2.8.   разделять Программный продукт на составные части;

3.2.9.   иным образом использовать Программный продукт не по назначению или способами, не описанными в документации, а равно с нарушением рекомендованных требований по аппаратным и программным средам.

3.3.    Пользователь вправе использовать Программный продукт на территории всего мира. Данное положение может иметь ограничения исходя из Типа предоставленной Пользователю Лицензии, а также конкретным договором, в соответствии с которым такая лицензия  приобретена.

3.4.    При использовании Программного продукт придерживаться правил деловой этики, воздерживаться от недобросовестных действий, в том числе, но не исключительно, которые прямо или косвенно оказывают негативное влияние на восприятие Программного продукта, деловой репутации Правообладателя.

3.5.    Программный продукт сопровождается сопутствующими материалами, представляющими собой описание, инструкции по настройке и использованию и т.п. Сопутствующие материалы являются самостоятельными объектами интеллектуальной собственности, исключительное право на которые принадлежит Правообладателю. Использование сопутствующих материалов в любых целях и любыми способами, отличными от целей и способов, необходимых для использования Программного продукта, запрещены.

## 4.     ПРОБНАЯ ВЕРСИЯ

4.1.    Право использования Программного продукта может быть предоставлено на условиях ознакомительной («Пробной», «Тестовой» и пр.) лицензии исключительно в целях оценки его функциональной части и оценки соответствия целям Пользователя. Настоящее Лицензионное соглашение подлежит применению к таким ознакомительным лицензиям в полном объеме.

4.2.    Срок действия ознакомительной лицензии, объем использования устанавливается Правообладателем самостоятельно и по своему усмотрению.

4.3.    Правообладатель вправе досрочно прекратить ознакомительный период, изменять объем и разрешенное использование Программного продукта.

4.4.    По истечении ознакомительного периода Пользователь обязуется незамедлительно прекратить использование Программного продукта и удалить имеющиеся у него копии Программных продуктов или приобрести лицензию на использование Программного продукта.

4.5.    Предоставление ознакомительной лицензии ни при каких обстоятельствах не может толковаться как предоставление открытой лицензии.

## 5.     МОНИТОРИНГ ИСПОЛЬЗОВАНИЯ

5.1.    Правообладатель вправе использовать технические средства защиты авторских прав для целей удаленного мониторинга работы Программного продукта, не уведомляя об этом Пользователя, в том числе, обезличено копировать, получать доступ, хранить, раскрывать и использовать данные об использовании Программного продукта, его настройках, программном и аппаратном окружении, оборудовании. Такой мониторинг может осуществляться для следующих целей (включая, но не ограничиваясь): осуществление контроля за правомерностью использования Программного продукта, сбор статистической информации, поиск возможных уязвимостей Программного продукта, улучшения Программного продукта, исследований.

5.2.    Средства защиты, помимо всего прочего, могут приостанавливать или отключать работу Программного продукта полностью или частично при обнаружении нарушений, истечении или прекращении действия Лицензии, невозможности обмена информацией между Программным продуктом и серверами Правообладателя через сеть Интернет при работе средств защиты авторских прав, нарушении условий Лицензионного соглашения. Какие-либо предварительные уведомления о приостановлении/отключении работы Программных продуктов не производятся.

5.3.    Правообладатель в рамках осуществления мониторинга, указанного в настоящем разделе, не собирает персональные данные. Сбор всех данных производится обезличено.

 

## 6.     ТЕХНИЧЕСКАЯ ПОДДЕРЖКА

6.1.    Правообладатель вправе предоставлять Пользователю техническую поддержку по вопросам, связанным с использованием Программных продуктов, в частности, касающихся установки, настройки и использования. Такая поддержка оказывается только в отношении экземляров Программного продукта, лицензия на использование которого получена по конкретному договору непосредственно у Правообладателя.

6.2.    Предоставление Технической поддержки производится только в telegram и whatapp(письменно).

6.3.    Правообладатель не оказывает техническую поддержку Пользователям, если Лицензия в порядке п. 2.2. не приобретена непосредственно у него. Подробный Регламент технической поддержки размещен на Сайте Правообладателя.

 

## 7.     ОБНОВЛЕНИЕ ПРОГРАММНЫХ ПРОДУКТОВ

7.1.    Правообладатель может периодически исключительно по собственному усмотрению и исходя из собственного плана разработки выпускать обновления Программного продукта, в результате установки которых производится устранение ошибок, расширение, изменение функциональных возможностей, изменение визуального отображения Программного продукта и другие изменения.

7.2.    В ходе обновлений могут изменяться минимальные требования к аппаратному или программному окружению, изменяться поддерживаемые операционные системы и другие условия функционирования.

7.3.    Правообладатель не принимает никаких обязательств по поддержке отдельных операционных систем, технологий и вспомогательного программного обеспечения.

7.4.    Загрузка и установка обновлений Программного продукта осуществляется автоматически, при условии, что сервер, на котором установлен Программный продукт, подключен к информационно-телекоммуникационной сети Интернет и имеет активную лицензию. Загрузка и установка обновлений Программного продукта осуществляется только с согласия Пользователя.

7.5.    Плата не взымается за доступ к обновлениям Программного продукта, право использования которого предоставлено на основании годовой или месячной лицензий. Некоторые обновления могут предоставляться за плату. В этом случае Правообладатель предварительно уведомит Пользователя.

##  8.     СОГЛАШЕНИЕ О КОНФИДЕНЦИАЛЬНОСТИ

8.1.    Настоящим Стороны соглашаются, что любая конфиденциальная информация, ставшая известной в связи с настоящим Лицензионным соглашением, не подлежит разглашению какой-либо третьей стороне, за исключением случаев, предусмотренных законодательством или соглашением Сторон. Под конфиденциальной информацией понимается любая информация, к которой не имеется открытого доступа на законных основаниях, в том числе, но не исключительно, информация технологиях, ценах, коммерческих и технических планах,  иная другая информация, обладающая потенциальной ценностью в силу ее неизвестности третьим лицам.

8.2.    Любые отзывы, предложения, идеи, обращения, которые могут быть направлены Пользователем в адрес Правообладателя (Далее – Предложения) по любым каналам коммуникации в отношении Программных продуктов, не относятся к конфиденциальной информации. Направляя Предложение, Пользователь предоставляет Правообладателю исключительную, подлежащую передаче и сублицензированию, не ограниченную по территории, не предусматривающую уплаты роялти (или иного другого вознаграждения) лицензию на использование, изменение Предложения. 

8.3.    Правообладатель вправе использовать Предложения любым способом и для любых целей, в том числе для последующей коммерческой реализации, без выплаты какой-либо компенсации или вознаграждения. Одновременно Правообладатель не несет обязанности по рассмотрению Предложений.

## 9.     ОТВЕТСТВЕННОСТЬ СТОРОН

9.1.    За неисполнение или ненадлежащее исполнение обязательств по настоящему Лицензионному соглашению Стороны несут ответственность в соответствии с законодательством Российской Федерации и условиями настоящего Соглашения.

9.2.    Стороны освобождаются от ответственности за полное или частичное неисполнение обязательств по настоящему Лицензионному соглашению, если надлежащее исполнение оказалось невозможным вследствие непреодолимой силы, то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, возникших после заключения настоящего Лицензионного соглашения.

К таким обстоятельствам относятся: DDoS-атаки, нарушение связанности сетей, отключение электропитания активного оборудования сети Правообладателя, пожары, возникшие в результате событий природного характера, стихийные бедствия, военные действия, включая гражданскую войну, введение чрезвычайного положения, акты террора, массовые беспорядки, забастовки (исключая забастовки сотрудников Сторон), изменения в применимом законодательстве и другие возникшие после заключения настоящего Лицензионного соглашения обстоятельства, которые Сторона не могла ни предвидеть, ни предотвратить разумными мерами, если такие обстоятельства препятствуют надлежащему исполнению Сторонами своих обязательств.

9.3.    Правообладатель ни при каких обстоятельствах не несет никакой ответственности за упущенную выгоду, прямые или косвенные убытки, понесенные Пользователем при работе с Программным продуктом, а также за убытки, связанные с отзывом лицензионных прав (расторжение настоящего Лицензионного соглашения) на Программный продукт. Правообладатель не гарантирует отсутствие ошибок, равно их исправление. Пользователь заключает настоящее Лицензионное соглашение руководствуясь принципом «как есть».

9.4.    Пользователь полностью принимает на себя риск последствий использования Программного продукта, в т.ч. его взаимодействие с другим программным обеспечением, установленным на компьютере (сервере) Пользователя, и соглашается с тем, что результат использования Программного продукта может не соответствовать ожиданиям Пользователя.

9.5.    Ни при каких обстоятельствах Правообладатель не несет ответственность за любой ущерб или убытки (включая, но не ограничиваясь, упущенную выгоду, убытки, вызванные утратой конфиденциальной или иной информации), возникающие в связи с использованием или невозможностью использования Программного продукта, в т.ч. в случае отказа работы Программного продукта, даже если Пользователь направил уведомление о вероятности возникновения такого ущерба и/или убытков.

9.6.    Правообладатель обязуется защищать Пользователя от всех претензий, исков третьих лиц, связанных с правами на Программный продукт, а равно Правообладатель несет полную ответственность за соблюдение авторских прав третьих лиц при условии, что Пользователь своевременно уведомил Правообладателя о поступлении в его адрес таких претензий и не предпринимал без ведома Правообладателя никаких действий по их разрешению.

9.7.    Правообладатель оставляет за собой право незамедлительно расторгнуть настоящее Лицензионное соглашение в одностороннем порядке при его нарушении Пользователем.

## 10.   ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ

10.1.  Настоящее Лицензионное соглашение вступает в силу с момента его принятия Пользователем и действует в течение срока правомерного использования Программного продукта (действия Лицензии или пробного периода).

10.2.  Правообладатель вправе в одностороннем (внесудебном) порядке немедленно расторгнуть настоящее Лицензионное соглашение в случае нарушения Пользователем любого из положений настоящего.

10.3.  Правообладатель вправе в любое время в одностороннем порядке изменять условия настоящего Лицензионного соглашения, а также любых документов, на которые в нем сделана ссылка. В случае внесения изменений Правообладатель предоставит Пользователю возможность ознакомиться с новой версией Лицензионного соглашения в форме опубликования на Сайте Правообладателя. В случае несогласия с новой редакцией Лицензионного соглашение считается прекращенным. Дальнейшее использование Программного продукта после публикации новой редакции Лицензионного соглашения признается принятием новых условий и не требуется каких-либо дополнительных действий.

10.4.  При прекращении (независимо от причин) или истечении срока действия Лицензионного соглашения Пользователь обязуется удалить имеющиеся у него копии Программного продукта, сопутствующих материалов и по требованию Правообладателя предоставить соответствующее письменное подтверждение.

10.5.  В случае если одно или несколько положений настоящего Лицензионного соглашения будут признаны недействительными, то недействительность этих положений не затронет действия иных положений настоящего Соглашения, которые продолжат свое действие для регулирования отношений Сторон.

10.6.  Настоящее Лицензионное соглашение регулируется исключительно в соответствии с законодательством страны регистрации Правообладателя.

10.7.  В случае возникновения споров, стороны примут меры к их мирному разрешению в претензионном порядке. Срок рассмотрения претензии – 20 рабочих дней. В случае недостижения взаимоприемлемого урегулирования спора, он подлежит передачи на рассмотрение арбитражного суда по месту нахождения Правообладателя.

## 11.   АДРЕСА, КОНТАКТНЫЕ ДАННЫЕ И РЕКВИЗИТЫ

Правообладатель: Клишин Илья Николаевич, ИНН 505004193846.
Для Технической поддержки telegram и whatapp: +7999-812-1620'
    ]
];
